export interface User {
  login: string;
  password: string;
  name: string;
  personalMessage: string;
}

export const usersData: User[] = [
  {
    login: 'sasha',
    password: '123',
    name: 'Саша',
    personalMessage: 'Саша, с 8 Марта! Ты - наш капитан, который мастерски ведет продукт через любые шторма. Желаем, чтобы вектор развития всегда был верным, команда - вдохновленной, а в личной жизни всё складывалось по самому счастливому сценарию!'
  },
  {
    login: 'lera',
    password: '123',
    name: 'Лера',
    personalMessage: 'Лера, с 8 Марта! Ты - наш главный двигатель и сердце продукта. Желаем, чтобы задачи щелкались как орешки, а в жизни было побольше ярких путешествий и только целые ноги для новых маршрутов!'
  },
  {
    login: 'masha',
    password: '123',
    name: 'Маша',
    personalMessage: 'Маша, с праздником! Твой позитив делает наши будни светлыми. Пусть твои системы учета работают идеально в любом уголке страны, а рядом всегда будут понимающие коллеги и надежные тестировщики!'
  },
  {
    login: 'marina',
    password: '123',
    name: 'Марина',
    personalMessage: 'Марина, поздравляем! Желаем, чтобы бизнес-процессы всегда были стройными, а аналитика - точной. Пусть твоя смелость помогает достигать любых высот, а жизнь радует только приятными сюрпризами!'
  },
  {
    login: 'alesya',
    password: '123',
    name: 'Алеся',
    personalMessage: 'Алеся, с 8 Марта! Пусть работа над масштабными проектами приносит драйв, а музыка в душе никогда не затихает. Желаем гармонии между сложными системными задачами и творческим вдохновением!'
  },
  {
    login: 'kristina',
    password: '123',
    name: 'Кристина',
    personalMessage: 'Кристина, с прекрасным весенним праздником! Пусть в работе всё будет понятно до последней детали, а каждый твой выбор из множества вариантов ведет к самому счастливому результату!'
  },
  {
    login: 'nastya',
    password: '123',
    name: 'Настя',
    personalMessage: 'Настя, с праздником! Ты - наш страж качества. Желаем, чтобы в жизни всё шло по "позитивному сценарию", баги обходили стороной, а свободное время было наполнено сладостью любимых конфет!'
  },
  {
    login: 'ksyusha',
    password: '123',
    name: 'Ксюша',
    personalMessage: 'Ксюша, с 8 Марта! Спасибо за твой вклад в команду. Пусть уют загородной жизни дает силы для новых трудовых подвигов, а каждый релиз проходит гладко и без лишних нервов!'
  },
  {
    login: 'sveta',
    password: '123',
    name: 'Света',
    personalMessage: 'Света, поздравляем! Пусть на проекте встречаются только те задачи, от которых горят глаза. Желаем, чтобы в жизни всегда было место для творчества и стихов, а работа приносила только удовлетворение!'
  },
  {
    login: 'oksana',
    password: '123',
    name: 'Оксана',
    personalMessage: 'Оксана, с 8 Марта! Желаем тебе чистого и красивого кода, легких деплоев и бесконечного вдохновения. Пусть каждый твой день будет солнечным, как зимовка в Таиланде!'
  }
];